cfd/V01_fan/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }

convertToMeters 0.001;
vertices
(
(0 100 150)
(10 100 150)
(10 150 150)
(0 150 150)
(0 100 850)
(10 100 850)
(10 150 850)
(0 150 850)
(10 650 150)
(0 650 150)
(10 650 850)
(0 650 850)
(10 700 150)
(0 700 150)
(10 700 850)
(0 700 850)
(150 100 150)
(150 150 150)
(150 100 850)
(150 150 850)
(150 650 150)
(150 650 850)
(150 700 150)
(150 700 850)
(180 100 150)
(180 150 150)
(180 100 850)
(180 150 850)
(180 650 150)
(180 650 850)
(180 700 150)
(180 700 850)
(220 100 150)
(220 150 150)
(220 100 850)
(220 150 850)
(220 650 150)
(220 650 850)
(220 700 150)
(220 700 850)
(250 100 150)
(250 150 150)
(250 100 850)
(250 150 850)
(250 650 150)
(250 650 850)
(250 700 150)
(250 700 850)
(290 100 150)
(290 150 150)
(290 100 850)
(290 150 850)
(290 650 150)
(290 650 850)
(290 700 150)
(290 700 850)
(320 100 150)
(320 150 150)
(320 100 850)
(320 150 850)
(320 650 150)
(320 650 850)
(320 700 150)
(320 700 850)
(500 100 150)
(500 150 150)
(500 100 850)
(500 150 850)
(500 650 150)
(500 650 850)
(320 150 1600)
(500 150 1600)
(500 650 1600)
(320 650 1600)
(320 150 1850)
(500 150 1850)
(500 650 1850)
(320 650 1850)
(320 150 2000)
(500 150 2000)
(500 650 2000)
(320 650 2000)
(500 700 150)
(500 700 850)
(690 150 850)
(690 650 850)
(690 150 1600)
(690 650 1600)
(690 150 1850)
(690 650 1850)
(690 150 2000)
(690 650 2000)
(700 150 1600)
(700 650 1600)
(700 150 1850)
(700 650 1850)
);
blocks
(
hex (0 1 2 3 4 5 6 7) AIR_INLET (1 3 35) simpleGrading (1 1 1)
hex (3 2 8 9 7 6 10 11) AIR_INLET (1 25 35) simpleGrading (1 1 1)
hex (9 8 12 13 11 10 14 15) AIR_INLET (1 3 35) simpleGrading (1 1 1)
hex (1 16 17 2 5 18 19 6) DIRTY_PLENUM (7 3 35) simpleGrading (1 1 1)
hex (2 17 20 8 6 19 21 10) DIRTY_PLENUM (7 25 35) simpleGrading (1 1 1)
hex (8 20 22 12 10 21 23 14) DIRTY_PLENUM (7 3 35) simpleGrading (1 1 1)
hex (16 24 25 17 18 26 27 19) STAGE_01 (2 3 35) simpleGrading (1 1 1)
hex (17 25 28 20 19 27 29 21) STAGE_01 (2 25 35) simpleGrading (1 1 1)
hex (20 28 30 22 21 29 31 23) STAGE_01 (2 3 35) simpleGrading (1 1 1)
hex (24 32 33 25 26 34 35 27) INTERSTAGE_01 (2 3 35) simpleGrading (1 1 1)
hex (25 33 36 28 27 35 37 29) INTERSTAGE_01 (2 25 35) simpleGrading (1 1 1)
hex (28 36 38 30 29 37 39 31) INTERSTAGE_01 (2 3 35) simpleGrading (1 1 1)
hex (32 40 41 33 34 42 43 35) STAGE_02 (2 3 35) simpleGrading (1 1 1)
hex (33 41 44 36 35 43 45 37) STAGE_02 (2 25 35) simpleGrading (1 1 1)
hex (36 44 46 38 37 45 47 39) STAGE_02 (2 3 35) simpleGrading (1 1 1)
hex (40 48 49 41 42 50 51 43) INTERSTAGE_02 (2 3 35) simpleGrading (1 1 1)
hex (41 49 52 44 43 51 53 45) INTERSTAGE_02 (2 25 35) simpleGrading (1 1 1)
hex (44 52 54 46 45 53 55 47) INTERSTAGE_02 (2 3 35) simpleGrading (1 1 1)
hex (48 56 57 49 50 58 59 51) STAGE_03 (2 3 35) simpleGrading (1 1 1)
hex (49 57 60 52 51 59 61 53) STAGE_03 (2 25 35) simpleGrading (1 1 1)
hex (52 60 62 54 53 61 63 55) STAGE_03 (2 3 35) simpleGrading (1 1 1)
hex (56 64 65 57 58 66 67 59) CLEAN_PLENUM (9 3 35) simpleGrading (1 1 1)
hex (57 65 68 60 59 67 69 61) CLEAN_PLENUM (9 25 35) simpleGrading (1 1 1)
hex (59 67 69 61 70 71 72 73) CLEAN_RISER (9 25 38) simpleGrading (1 1 1)
hex (70 71 72 73 74 75 76 77) CLEAN_RISER (9 25 13) simpleGrading (1 1 1)
hex (74 75 76 77 78 79 80 81) CLEAN_RISER (9 25 8) simpleGrading (1 1 1)
hex (60 68 82 62 61 69 83 63) CLEAN_PLENUM (9 3 35) simpleGrading (1 1 1)
hex (67 84 85 69 71 86 87 72) CLEAN_RISER (10 25 38) simpleGrading (1 1 1)
hex (71 86 87 72 75 88 89 76) CLEAN_RISER (10 25 13) simpleGrading (1 1 1)
hex (75 88 89 76 79 90 91 80) CLEAN_RISER (10 25 8) simpleGrading (1 1 1)
hex (86 92 93 87 88 94 95 89) AIR_OUTLET (1 25 13) simpleGrading (1 1 1)
);
edges ();
boundary
(
AIR_INLET
{
 type patch;
 faces
(
(0 4 7 3)
(3 7 11 9)
(9 11 15 13)
);
}
AIR_OUTLET
{
 type patch;
 faces
(
(92 93 95 94)
);
}
WALLS
{
 type wall;
 faces
(
(0 1 5 4)
(0 3 2 1)
(4 5 6 7)
(3 9 8 2)
(7 6 10 11)
(13 15 14 12)
(9 13 12 8)
(11 10 14 15)
(1 16 18 5)
(1 2 17 16)
(5 18 19 6)
(2 8 20 17)
(6 19 21 10)
(12 14 23 22)
(8 12 22 20)
(10 21 23 14)
(16 24 26 18)
(16 17 25 24)
(18 26 27 19)
(17 20 28 25)
(19 27 29 21)
(22 23 31 30)
(20 22 30 28)
(21 29 31 23)
(24 32 34 26)
(24 25 33 32)
(26 34 35 27)
(25 28 36 33)
(27 35 37 29)
(30 31 39 38)
(28 30 38 36)
(29 37 39 31)
(32 40 42 34)
(32 33 41 40)
(34 42 43 35)
(33 36 44 41)
(35 43 45 37)
(38 39 47 46)
(36 38 46 44)
(37 45 47 39)
(40 48 50 42)
(40 41 49 48)
(42 50 51 43)
(41 44 52 49)
(43 51 53 45)
(46 47 55 54)
(44 46 54 52)
(45 53 55 47)
(48 56 58 50)
(48 49 57 56)
(50 58 59 51)
(49 52 60 57)
(51 59 61 53)
(54 55 63 62)
(52 54 62 60)
(53 61 63 55)
(64 65 67 66)
(56 64 66 58)
(56 57 65 64)
(58 66 67 59)
(65 68 69 67)
(57 60 68 65)
(59 70 73 61)
(59 67 71 70)
(61 73 72 69)
(70 74 77 73)
(70 71 75 74)
(73 77 76 72)
(74 78 81 77)
(74 75 79 78)
(77 81 80 76)
(78 79 80 81)
(68 82 83 69)
(62 63 83 82)
(60 62 82 68)
(61 69 83 63)
(84 85 87 86)
(67 84 86 71)
(69 72 87 85)
(67 69 85 84)
(71 86 88 75)
(72 76 89 87)
(88 89 91 90)
(75 88 90 79)
(76 80 91 89)
(79 90 91 80)
(86 92 94 88)
(87 89 95 93)
(86 87 93 92)
(88 94 95 89)
);
}
);
mergePatchPairs ();
